---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeDeterminationParam
source: html/176480dd-f2b7-03cc-24b0-bd3ec13f6a9f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeDeterminationParam Property

"Building Envelope"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeDeterminationParam { get; }
```